### CSV files reading methods

In [2]:
# With open() funktion and .read() method

with open("fruits_2.csv", "r", encoding = "utf-8") as file :
    print(file.read())

no,fruit,amount
1,Banana,4 lb
2,Orange,5 lb
3,Apple,2 lb
4,Strawberry,6 lb
5,Cherry,3 lb

In [3]:
with open("people.csv", "r", encoding = "utf-8") as file :
    print(file.read())

row num,first name,last name, age
1,Haluk,Kutlu,50
2,Meltem,Kutlu,45
3,Duygu,Kutlu,24
4,Mert,Kutlu,20
5,Zeynep,Kutlu,13

In [8]:
# CSV Module

import csv

with open("fruits_2.csv", "r", newline = '', encoding = "utf-8") as file :
    csv_rows = csv.reader(file, delimiter = ",")
    
    for row in csv_rows:
        print(row)

['no', 'fruit', 'amount']
['1', 'Banana', '4 lb']
['2', 'Orange', '5 lb']
['3', 'Apple', '2 lb']
['4', 'Strawberry', '6 lb']
['5', 'Cherry', '3 lb']

In [9]:
with open("people.csv", "r", newline = '', encoding = "utf-8") as file :
    csv_row = csv.reader(file, delimiter = ",")
    
    for row in csv_row:
        print(row)

['row num', 'first name', 'last name', ' age']
['1', 'Haluk', 'Kutlu', '50']
['2', 'Meltem', 'Kutlu', '45']
['3', 'Duygu', 'Kutlu', '24']
['4', 'Mert', 'Kutlu', '20']
['5', 'Zeynep', 'Kutlu', '13']

In [11]:
with open("people.csv", "r", newline = '', encoding = "utf-8") as file :
    csv_row = csv.reader(file, delimiter = ";")
    
    for row in csv_row:
        print(row)
# When we use another char, returns one  element in list

['row num,first name,last name, age']
['1,Haluk,Kutlu,50']
['2,Meltem,Kutlu,45']
['3,Duygu,Kutlu,24']
['4,Mert,Kutlu,20']
['5,Zeynep,Kutlu,13']

In [12]:
with open("people_2.csv", "r", encoding = "utf-8") as file :
    print(file.read())

row num-first name-last name-age
1-Haluk-Kutlu-50
2-Meltem-Kutlu-45
3-Duygu-Kutlu-24
4-Mert-Kutlu-20
5-Zeynep-Kutlu-13

In [13]:
with open("people_2.csv", "r", newline = '', encoding = "utf-8") as file :
    csv_row2 = csv.reader(file, delimiter = "-")
    
    for row2 in csv_row2:
        print(row2)

['row num', 'first name', 'last name', 'age']
['1', 'Haluk', 'Kutlu', '50']
['2', 'Meltem', 'Kutlu', '45']
['3', 'Duygu', 'Kutlu', '24']
['4', 'Mert', 'Kutlu', '20']
['5', 'Zeynep', 'Kutlu', '13']

In [16]:
import pandas as pd

In [17]:
df = pd.read_csv("fruits_2.csv")
df

   no       fruit amount
0   1      Banana   4 lb
1   2      Orange   5 lb
2   3       Apple   2 lb
3   4  Strawberry   6 lb
4   5      Cherry   3 lb

In [18]:
cd = pd.read_csv("people.csv", index_col = 0)

cd

        first name last name   age
row num
1            Haluk     Kutlu    50
2           Meltem     Kutlu    45
3            Duygu     Kutlu    24
4             Mert     Kutlu    20
5           Zeynep     Kutlu    13

In [21]:
kl = pd.read_csv("people_2.csv", sep = "-", index_col = 0)
kl

        first name last name  age
row num
1            Haluk     Kutlu   50
2           Meltem     Kutlu   45
3            Duygu     Kutlu   24
4             Mert     Kutlu   20
5           Zeynep     Kutlu   13